In [1]:
import pandas as pd

In [5]:
dataset1=pd.read_csv('employees.csv')
first_five=dataset1.iloc[:5,:].values
print(first_five)

[[0 101 'Alice' 'HR' 29 50000 4 '2020-03-15' 'Female' 5000 4.5]
 [1 102 'Bob' 'IT' 34 70000 8 '2017-07-19' 'Male' 7000 4.0]
 [2 103 'Charlie' 'IT' 41 65000 10 '2013-06-01' 'Male' 6000 3.8]
 [3 104 'Diana' 'Marketing' 28 55000 3 '2021-02-10' 'Female' 4500 4.7]
 [4 105 'Edward' 'Sales' 38 60000 12 '2010-11-25' 'Male' 5000 3.5]]

In [7]:
dataset1_del_row = dataset1.drop(index = 4)
dataset1_del_col = dataset1_del_row.drop(dataset1_del_row.columns[2],axis = 1)
dataset1_del_col.head()

,Unnamed: 0,Employee_ID,Department,Age,Salary,Years_of_Experience,Joining_Date,Gender,Bonus,Rating
0,0,101,HR,29,50000,4,2020-03-15,Female,5000,4.5
1,1,102,IT,34,70000,8,2017-07-19,Male,7000,4.0
2,2,103,IT,41,65000,10,2013-06-01,Male,6000,3.8
3,3,104,Marketing,28,55000,3,2021-02-10,Female,4500,4.7